package com.company.homework.cycles;

/*
* 6. Составьте программу, выводящую на экран квадраты чисел от 10 до 20
     включительно.
* */
public class Task6 {

    public static void sixth() {
        for (int i = 10; i <= 20; i++) {
            System.out.println("Квадрат числа " + i + " равен " + (i * i));
        }
    }
}
